#+AUTHOR:    Anton S. Kosinov
#+TITLE:     A design pattern sample
#+SUBTITLE:  pattern motto
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both

Hope [[http://0--key.github.io/python3/design/patterns/creational/factory.html][this page]] could elucidate this pattern in a bit explicit
manner.

** Pet factory
   Creates some particular animal out from arbitrary number preliminary
   defined pets.

   #+HTML: <table><tbody><tr><th>Pattern code</th>
   #+HTML: <th>Test suite</th></tr><tr><td valign="top">
   #+BEGIN_SRC python :tangle pet_shop.py :exports both
     #!/usr/bin/env python
     # -*- coding: utf-8 -*-
     """
     A pet shop abstraction
     """


     class Dog(object):
         """One of the objects to be returned"""

         def speak(self):
             return "Woof!"

         def __str__(self):
             return "Dog"


     class DogFactory(object):
         """Concrete Factory"""

         def get_pet(self):
             """Returns a Dog object"""
             return Dog()

         def get_food(self):
             """Returns a Dog Food object"""
             return "Dog Food!"


     class PetStore(object):
         """ PetStore houses our Abstract Factory """

         def __init__(self, pet_factory=None):
             """ pet_factory is our Abstract Factory """

             self._pet_factory = pet_factory

         def show_pet(self):
             """ Utility method to display the details of the objects retured by the DogFactory """

             pet = self._pet_factory.get_pet()
             pet_food = self._pet_factory.get_food()

             print("Our pet is '{}'!".format(pet))
             print("Our pet says hello by '{}'".format(pet.speak()))
             print("Its food is '{}'!".format(pet_food))


     # Create a Concrete Factory
     factory = DogFactory()

     # Create a pet store housing our Abstract Factory
     shop = PetStore(factory)

     # Invoke the utility method to show the details of our pet
     shop.show_pet()
   #+END_SRC

   #+RESULTS:
   : Our pet is 'Dog'!
   : Our pet says hello by 'Woof!'
   : Its food is 'Dog Food!'!

   #+HTML: </td><td valign="top">

   #+BEGIN_SRC python :tangle test_abstract_factory.py
     #!/usr/bin/env python
     # -*- coding: utf-8 -*-
     """
     An attempt to illustrate how pet shop works
     """
     import unittest


     class TestSimpleBehavior(unittest.TestCase):

         def setUp(self):
             pass

         def test_primitive_TravisCI(self):
             self.assertTrue(3 + 1 == 4)

         def tearDown(self):
             pass
   #+END_SRC

   #+HTML: </td></tr></tbody></table>

